Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_otg_hs_device.h
// OTG_HS_DIEPCTL7 Configuration

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA             (0x1U<<31)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS             (0x1U<<30)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM           (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM    (0x1U<<28)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK              (0x1U<<27)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK              (0x1U<<26)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM            (0xFU<<22)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_0          (0x1U<<22)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_STALL             (0x1U<<21)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP             (0x3U<<18)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_0           (0x1U<<18)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS            (0x1U<<17)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID        (0x1U<<16)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP            (0x1U<<15)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ             (0x7FFU<<0)
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_0           (0x1U<<0)

// OTG_HS_DIEPINT7 Configuration

#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_NAK               (0x1U<<13)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_BERR              (0x1U<<12)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS         (0x1U<<11)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_BNA               (0x1U<<9)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN        (0x1U<<8)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_TXFE              (0x1U<<7)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE            (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE            (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_TOC               (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_XFRC              (0x1U<<0)

// OTG_HS_DOEPCTL0 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA             (0x1U<<31)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS             (0x1U<<30)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK              (0x1U<<27)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK              (0x1U<<26)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_STALL             (0x1U<<21)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM              (0x1U<<20)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP             (0x3U<<18)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_0           (0x1U<<18)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS            (0x1U<<17)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP            (0x1U<<15)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ             (0x3U<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_0           (0x1U<<0)

// OTG_HS_DOEPINT0 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_NYET              (0x1U<<14)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP           (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS           (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_STUP              (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_XFRC              (0x1U<<0)

// OTG_HS_DOEPTSIZ0 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT          (0x3U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_0        (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT           (0x1U<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ           (0x7FU<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_0         (0x1U<<0)

// OTG_HS_DOEPCTL1 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA             (0x1U<<31)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS             (0x1U<<30)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM           (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM    (0x1U<<28)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK              (0x1U<<27)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK              (0x1U<<26)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_STALL             (0x1U<<21)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM              (0x1U<<20)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP             (0x3U<<18)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP_0           (0x1U<<18)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS            (0x1U<<17)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID        (0x1U<<16)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP            (0x1U<<15)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ             (0x7FFU<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ_0           (0x1U<<0)

// OTG_HS_DOEPINT1 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_NYET              (0x1U<<14)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP           (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS           (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_STUP              (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT1_XFRC              (0x1U<<0)

// OTG_HS_DOEPTSIZ1 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT   (0x3U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_0 (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT           (0x3FFU<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_0         (0x1U<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ           (0x7FFFFU<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_0         (0x1U<<0)

// OTG_HS_DOEPCTL2 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA             (0x1U<<31)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS             (0x1U<<30)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM           (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM    (0x1U<<28)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK              (0x1U<<27)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK              (0x1U<<26)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_STALL             (0x1U<<21)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM              (0x1U<<20)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP             (0x3U<<18)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_0           (0x1U<<18)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS            (0x1U<<17)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID        (0x1U<<16)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP            (0x1U<<15)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ             (0x7FFU<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_0           (0x1U<<0)

// OTG_HS_DOEPINT2 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_NYET              (0x1U<<14)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP           (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS           (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_STUP              (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT2_XFRC              (0x1U<<0)

