Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_otg_hs_device.h
// OTG_HS_DOEPTSIZ2 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT   (0x3U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_0 (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT           (0x3FFU<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_0         (0x1U<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ           (0x7FFFFU<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_0         (0x1U<<0)

// OTG_HS_DOEPCTL3 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA             (0x1U<<31)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS             (0x1U<<30)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM           (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM    (0x1U<<28)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK              (0x1U<<27)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK              (0x1U<<26)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_STALL             (0x1U<<21)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM              (0x1U<<20)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP             (0x3U<<18)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_0           (0x1U<<18)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS            (0x1U<<17)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID        (0x1U<<16)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP            (0x1U<<15)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ             (0x7FFU<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_0           (0x1U<<0)

// OTG_HS_DOEPINT3 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPINT3_NYET              (0x1U<<14)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP           (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS           (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT3_STUP              (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT3_XFRC              (0x1U<<0)

// OTG_HS_DOEPTSIZ3 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT   (0x3U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_0 (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT           (0x3FFU<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_0         (0x1U<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ           (0x7FFFFU<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_0         (0x1U<<0)

// OTG_HS_DOEPINT4 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_NYET              (0x1U<<14)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP           (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS           (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_STUP              (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_XFRC              (0x1U<<0)

// OTG_HS_DOEPTSIZ4 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT   (0x3U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_0 (0x1U<<29)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT           (0x3FFU<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_0         (0x1U<<19)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ           (0x7FFFFU<<0)
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_0         (0x1U<<0)

// OTG_HS_DOEPINT5 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_NYET              (0x1U<<14)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP           (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS           (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_STUP              (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_XFRC              (0x1U<<0)

// OTG_HS_DOEPINT6 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_NYET              (0x1U<<14)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP           (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS           (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_STUP              (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_XFRC              (0x1U<<0)

// OTG_HS_DOEPINT7 Configuration

#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_NYET              (0x1U<<14)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP           (0x1U<<6)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS           (0x1U<<4)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_STUP              (0x1U<<3)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD            (0x1U<<1)
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_XFRC              (0x1U<<0)
